       77  WRK-VENDAS                 PIC 9(06)V99    VALUE ZEROS.
       77  WRK-QUANTIDADE             PIC 9(03)       VALUE 0.
       77  WRK-ACUMULADOR             PIC 9(08)V99    VALUE ZEROS.
