       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB20.
      *********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = FELIPE
      * OBJETIVO: RECEBER E SOMAR VENDAS
      * UTILIZAR PERFORM UNTIL
      * DATA   = 13/05/2021
      *********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-VENDAS                 PIC 9(06)V99    VALUE ZEROS.
       77  WRK-QUANTIDADE             PIC 9(03)       VALUE 0.
       77  WRK-ACUMULADOR             PIC 9(08)V99    VALUE ZEROS.

       PROCEDURE DIVISION.

       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-VENDAS > 0
               PERFORM 0200-PROCESSAR UNTIL WRK-VENDAS = 0
           END-IF.
           PERFORM 0300-FINALIZAR.

           STOP RUN.

       0100-INICIALIZAR.
           DISPLAY 'VENDAS..'.
           ACCEPT WRK-VENDAS.

       0200-PROCESSAR.
           ADD 1 TO WRK-QUANTIDADE.
           ADD WRK-VENDAS TO WRK-ACUMULADOR.
           PERFORM 0100-INICIALIZAR.


       0300-FINALIZAR.
           DISPLAY '----------------'.
           DISPLAY 'ACUMULADO..' WRK-ACUMULADOR.
           DISPLAY 'QUANTIDADE..' WRK-QUANTIDADE.
           DISPLAY 'FINAL DE PROCESSAMENTO'.
