       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB14.
      *********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = FELIPE
      * OBJETIVO: RECEBER LARGURA E COMPRIMENTO
      * CALCULAR AREA
      * DATA   = 13/05/2021
      *********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-LARGURA       PIC 9(03)V99   VALUE ZEROS.
       77  WRK-COMPRIMENTO   PIC 9(03)V99   VALUE ZEROS.
       77  WRK-AREA          PIC 9(03)V99   VALUE ZEROS.
       PROCEDURE DIVISION.
           DISPLAY 'LARGURA.. '
           ACCEPT WRK-LARGURA.

           DISPLAY 'COMPRIMENTO.. '
           ACCEPT WRK-COMPRIMENTO.

           IF WRK-LARGURA GREATER 0 AND WRK-COMPRIMENTO > 0
               COMPUTE WRK-AREA = (WRK-LARGURA * WRK-COMPRIMENTO)
               DISPLAY 'AREA..' WRK-AREA
           ELSE
               DISPLAY 'INFORME MEDIDAS VALIDAS'
           END-IF.

           STOP RUN.
