       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB21.
      *********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = FELIPE
      * OBJETIVO: RECEBER E SOMAR VENDAS
      * UTILIZAR COPY PARA IMPORTAR VARIAVEIS
      * DATA   = 13/05/2021
      *********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY 'BOOK.COB'.

       PROCEDURE DIVISION.

       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-VENDAS > 0
               PERFORM 0200-PROCESSAR UNTIL WRK-VENDAS = 0
           END-IF.
           PERFORM 0300-FINALIZAR.

           STOP RUN.

       0100-INICIALIZAR.
           DISPLAY 'VENDAS..'.
           ACCEPT WRK-VENDAS.

       0200-PROCESSAR.
           ADD 1 TO WRK-QUANTIDADE.
           ADD WRK-VENDAS TO WRK-ACUMULADOR.
           PERFORM 0100-INICIALIZAR.


       0300-FINALIZAR.
           DISPLAY '----------------'.
           DISPLAY 'ACUMULADO..' WRK-ACUMULADOR.
           DISPLAY 'QUANTIDADE..' WRK-QUANTIDADE.
           DISPLAY 'FINAL DE PROCESSAMENTO'.
